PAKHYUNMOON/CC1101_CC2500/app/slave/s_main.c
       uint32_t tag = Slave_Mac32(mac_input,
                                  (uint8_t)(1U + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN + STREAM_FRAME_COUNTER_LEN + 4U + logical_len));
       body[2] = (uint8_t)(tag & 0xFFU);
       body[3] = (uint8_t)((tag >> 8) & 0xFFU);
       body[4] = (uint8_t)((tag >> 16) & 0xFFU);
       body[5] = (uint8_t)((tag >> 24) & 0xFFU);
       body[STREAM_AUTH_LEN] = logical[0]; /* stream_seq */
       body[STREAM_AUTH_LEN + 1U] = copy_idx;
       body[STREAM_AUTH_LEN + 2U] = STREAM_FEC_COPIES;
       body[STREAM_AUTH_LEN + 3U] = logical_len;
       memcpy(&body[STREAM_AUTH_LEN + 4U], logical, logical_len); 

       Proto_Packet pkt;
       pkt.fcf = Proto_FCF_Make(MICS_FCF_TYPE_DATA, false, true);
       pkt.seq = g_seq++;
       pkt.sess = g_session_id;
       pkt.payload_len = Proto_BuildDataPayload(MICS_DTYPE_ECG_DELTA,
                                                g_my_id,
                                                g_authorized_master_id,
                                                body,
                                                (uint8_t)(STREAM_AUTH_LEN + 4U + logical_len),
                                                pkt.payload,
                                                sizeof(pkt.payload));
       if (pkt.payload_len == 0U) {
           return false;
       }
       SLAVE_LOG("[SLAVE] stream_tx seq=%u copy=%u/%u fc=%u\r\n",
                 (unsigned)logical[0], (unsigned)copy_idx,
                 (unsigned)STREAM_FEC_COPIES,
                 (unsigned)frame_counter);
       Slave_SendResponse(&pkt, channel);
   }
   g_stream_frame_counter++;

   return true;
}

/* ========================================================================== */
/* Ship mode sleep  (long-term storage / transport)                            */
/* ========================================================================== */

/* Next RTC period from cumulative ship time (see file-header schedule). */
static uint32_t Slave_ShipRtcPeriodForElapsed(uint32_t elapsed_sec)
{
   if (elapsed_sec < SLAVE_SHIP_PHASE_5MIN_END_SEC) {
       return SLAVE_SHIP_SEC_5MIN;
   }
   if (elapsed_sec < SLAVE_SHIP_PHASE_30MIN_END_SEC) {
       return SLAVE_SHIP_SEC_30MIN;
   }
   if (elapsed_sec < SLAVE_SHIP_PHASE_1H_END_SEC) {
       return SLAVE_SHIP_SEC_1H;
   }
   if (elapsed_sec < SLAVE_SHIP_PHASE_2H_END_SEC) {
       return SLAVE_SHIP_SEC_2H;
   }
   if (elapsed_sec < SLAVE_SHIP_MAX_ELAPSED_SEC) {
       return SLAVE_SHIP_SEC_3H;
   }
   return SLAVE_SHIP_SEC_3H;
}

static void Slave_EnterShipSleep(void)
{
   g_slave_pwr_trace.ship_entries++;
   g_slave_pwr_trace.last_stop2_enter_ms = HAL_GetTick();

   /* Already exceeded max ship time — force NORMAL without another Stop 3. */
   if (g_ship_elapsed_sec >= SLAVE_SHIP_MAX_ELAPSED_SEC) {
       g_power_profile          = SLAVE_RUN_NORMAL;
       g_ship_elapsed_sec       = 0U;
       g_ship_last_interval_sec = 0U;
       LP_DisableWakeUpPin(SLAVE_SHIP_WKUP_HAL_PIN);
       return;
   }

   /* Both radios into hard Sleep: WOR is intentionally disabled in ship mode.
    * CC2500 GDO0 EXTI is still wired but the radio will not assert it. */
   CC1101_EnterSleep(&g_cc1101);
   CC2500_EnterSleep(&g_cc2500);

   g_ship_last_interval_sec = Slave_ShipRtcPeriodForElapsed(g_ship_elapsed_sec);
   LP_ConfigureRTCWakeUp(&g_lp, g_ship_last_interval_sec);

   /* Physical exit from ship: enable STM32 WKUP (Stop 3); cleared when leaving SHIP. */
   LP_EnableWakeUpPin(SLAVE_SHIP_WKUP_HAL_PIN);

   LP_WakeupSource src = LP_EnterStop3(&g_lp);

   g_slave_pwr_trace.last_stop2_exit_ms = HAL_GetTick();

   if (src & LP_WAKEUP_RTC_ALARM) {
       g_ship_elapsed_sec += g_ship_last_interval_sec;
       g_slave_pwr_trace.ship_rtc_wakeup_count++;
       g_slave_pwr_trace.wakeup_rtc_count++;

       g_sensor_data[8] = (uint8_t)(g_ship_elapsed_sec & 0xFFU);

       if (g_ship_elapsed_sec >= SLAVE_SHIP_MAX_ELAPSED_SEC) {
           g_power_profile          = SLAVE_RUN_NORMAL;
           g_ship_elapsed_sec       = 0U;
           g_ship_last_interval_sec = 0U;
           LP_DisableWakeUpPin(SLAVE_SHIP_WKUP_HAL_PIN);
       }
   }

   if (src & LP_WAKEUP_WKUP_PIN) {
       g_power_profile          = SLAVE_RUN_NORMAL;
       g_ship_elapsed_sec       = 0U;
       g_ship_last_interval_sec = 0U;
       LP_DisableWakeUpPin(SLAVE_SHIP_WKUP_HAL_PIN);
   }
}

/* ========================================================================== */
/* Deep sleep entry (main idle state)                                          */
/* ========================================================================== */

static void Slave_EnterDeepSleep(void)
{
   /* Dispatch to ship FSM when in storage/transport mode */
   if (g_power_profile == SLAVE_RUN_SHIP) {
       Slave_EnterShipSleep();
       return;
   }

   g_slave_pwr_trace.stop2_entries++;
   g_slave_pwr_trace.last_stop2_enter_ms = HAL_GetTick();

   /* Ensure CC1101 is in sleep mode */
   CC1101_EnterSleep(&g_cc1101);

   /* If CC2500 was put into SPWD during MICS session, wake it first
    * so WOR strobes/register accesses are valid. */
   (void)CC2500_WakeFromSleep(&g_cc2500);

   /* Put CC2500 into WOR mode for wake-up monitoring */
   CC2500_EnterWOR(&g_cc2500);

   /* Configure RTC for periodic self-check */
   LP_ConfigureRTCWakeUp(&g_lp, SLAVE_RTC_WAKEUP_INTERVAL_S);

   /* Enter Stop 2 - MCU draws ~2 uA
    * Wake-up sources:
    *   - CC2500 GDO0 EXTI (beacon received)
    *   - RTC wake-up timer (periodic self-check)
    */
   (void)LP_EnterStop2(&g_lp);


   /* --- MCU wakes up here --- */
   g_slave_pwr_trace.last_stop2_exit_ms = HAL_GetTick();
   uint32_t wake_flags = Slave_ISR_PopWakeFlags();

   if (Slave_IsWakeFlagSet(wake_flags, SLAVE_ISR_WAKE_CC2500_GDO0)) {
       g_wakeup_flag = true;
       g_slave_pwr_trace.wakeup_exti_count++;
   }

   if (Slave_IsWakeFlagSet(wake_flags, SLAVE_ISR_WAKE_RTC)) {
       g_slave_pwr_trace.wakeup_rtc_count++;
       /* Periodic self-check: battery level, sensor status, etc.
        * If nothing to do, go back to sleep immediately */
       g_sensor_data[8] = (uint8_t)(HAL_GetTick() & 0xFFU);  /* timestamp */
   }
}

/* ========================================================================== */
/* Phase 1: Handle CC2500 wake-up beacon                                       */
/* ========================================================================== */

static int Slave_HandleWakeUp(void)
{
   uint8_t rx_buf[CC2500_PKT_MAX_LEN];
   uint8_t rx_len = 0U;

   /* 1) Read the received beacon packet from CC2500 */
   CC2500_Status st = CC2500_ReadPacket(&g_cc2500, rx_buf, &rx_len, sizeof(rx_buf));
   if (st != CC2500_OK) {
       return -1;
   }

