PAKHYUNMOON/CC1101_CC2500/app/slave/s_main.c
   /* 2) Parse MAC PDU */
   Proto_Packet beacon;
   if (Proto_ParsePacket(rx_buf, rx_len, &beacon) < 0) {
       return -2;
   }

   /* 3) Validate FCF: must be COMMAND type, ACK_REQ set */
   if (Proto_FCF_Type(beacon.fcf) != MICS_FCF_TYPE_COMMAND) {
       return -3;
   }
   if (!Proto_FCF_IsAckReq(beacon.fcf)) {
       return -3;
   }

   /* 4) Validate payload layout (13 B):
    *    [0]     DTYPE_COMMAND  [1]      CMD_WAKEUP_REQ
    *    [2..5]  DEVICE_ID      [6..9]   MASTER_ID
    *    [10]    SESS           [11]     CHANNEL      [12] flags
    */
   if (beacon.payload_len < PROTO_BEACON_PAYLOAD_LEN) {
       return -4;
   }
   if (beacon.payload[PROTO_BEACON_DTYPE_OFFSET] != MICS_DTYPE_COMMAND) {
       return -5;
   }
   if (beacon.payload[PROTO_BEACON_CMD_OFFSET] != CMD_WAKEUP_REQ) {
       return -6;
   }

   /* 5) Verify this beacon is addressed to us (or broadcast) */
   const uint8_t *target_id = &beacon.payload[PROTO_BEACON_DEVID_OFFSET];
   if (!Proto_MatchDeviceID(target_id, g_my_id)) {
       return -7;
   }

   /* 6) Verify MASTER_ID - reject beacons from unauthorised Masters.
    *    Without this check, anyone learning the Slave's DEVICE_ID could
    *    wake the implant and hold a session. */
   if (!Proto_VerifyPayloadMasterID(&beacon,
                                    PROTO_BEACON_MASTERID_OFFSET,
                                    g_authorized_master_id)) {
       return -8;  /* silent drop - unknown Master */
   }

   /* 7) Remember the SESS assigned by Master */
   uint8_t assigned_sess = beacon.payload[PROTO_BEACON_SESS_OFFSET];
   if ((assigned_sess == PROTO_SESS_UNASSIGNED) ||
       (assigned_sess == PROTO_SESS_BROADCAST)) {
       return -9; /* invalid SESS allocation */
   }

   /* 8) Remember the MICS channel the Master pre-selected via LBT.
    *    This removes the need for the Slave to scan channels 0..9 on 400 MHz,
    *    which saves significant battery on the implant. */
   uint8_t assigned_channel = beacon.payload[PROTO_BEACON_CHANNEL_OFFSET];
   if (assigned_channel >= CC1101_MICS_NUM_CHANNELS) {
       return -10; /* Master must pre-select a valid MICS channel */
   }

   g_session_id     = assigned_sess;
   g_active_channel = assigned_channel;
   g_last_rx_seq_valid = false;
   memset(g_session_nonce, 0, sizeof(g_session_nonce));

   SLAVE_LOG("[SLAVE] beacon_rx dev=%02X%02X%02X%02X mid=%02X%02X%02X%02X ch=%u sess=%u\r\n",
             beacon.payload[PROTO_BEACON_DEVID_OFFSET + 0U],
             beacon.payload[PROTO_BEACON_DEVID_OFFSET + 1U],
             beacon.payload[PROTO_BEACON_DEVID_OFFSET + 2U],
             beacon.payload[PROTO_BEACON_DEVID_OFFSET + 3U],
             beacon.payload[PROTO_BEACON_MASTERID_OFFSET + 0U],
             beacon.payload[PROTO_BEACON_MASTERID_OFFSET + 1U],
             beacon.payload[PROTO_BEACON_MASTERID_OFFSET + 2U],
             beacon.payload[PROTO_BEACON_MASTERID_OFFSET + 3U],
             (unsigned)g_active_channel, (unsigned)g_session_id);

   /* 9) Build and send wake-up ACK: echo DEVICE_ID + MASTER_ID +
    *    SESS + CHANNEL so Master can verify bilateral binding. */
   Proto_Packet ack;
   ack.fcf  = Proto_FCF_Make(MICS_FCF_TYPE_COMMAND, false, false);
   ack.seq  = g_seq++;
   ack.sess = PROTO_SESS_BROADCAST;  /* session not yet bilaterally confirmed */
   ack.payload_len = Proto_BuildBeaconPayload(CMD_WAKEUP_ACK,
                                              g_my_id,
                                              g_authorized_master_id,
                                              g_session_id,
                                              g_active_channel,
                                              0U,
                                              ack.payload,
                                              sizeof(ack.payload));
   if (ack.payload_len == 0U) {
       return -11;
   }

   uint8_t tx_buf[CC2500_PKT_MAX_LEN];
   uint8_t tx_len = Proto_BuildPacket(&ack, tx_buf, sizeof(tx_buf));
   if (tx_len == 0U) {
       return -12;
   }

   st = CC2500_SendPacketDirect(&g_cc2500, CC2500_WAKEUP_CHANNEL,
                                tx_buf, tx_len, 100U);
   if (st != CC2500_OK) {
       return -13;
   }

   SLAVE_LOG("[SLAVE] beacon_ack_tx sess=%u ch=%u\r\n",
             (unsigned)g_session_id, (unsigned)g_active_channel);
   return 0;
}

/* ========================================================================== */
/* Phase 2: MICS data session                                                  */
/* ========================================================================== */

/* Build a COMMAND-frame response carrying
*   [DTYPE, sub_cmd, g_my_id, g_authorized_master_id, args...] */
static void slave_build_cmd_response(Proto_Packet *resp,
                                    uint8_t sub_cmd,
                                    const uint8_t *args, uint8_t args_len)
{
   resp->fcf = Proto_FCF_Make(MICS_FCF_TYPE_COMMAND, false, false);
   resp->payload_len = Proto_BuildCommandPayload(sub_cmd, g_my_id,
                                                 g_authorized_master_id,
                                                 args, args_len,
                                                 resp->payload,
                                                 sizeof(resp->payload));
}

static int Slave_ProcessCommand(const Proto_Packet *req, Proto_Packet *resp)
{
   /* Use slave's own seq counter for responses (separate from master's space) */
   resp->seq  = g_seq++;
   resp->sess = g_session_id;

   /* All inbound COMMAND packets: payload = [DTYPE, SUBCMD, DEVID[4], args] */
   if (req->payload_len < PROTO_CMD_HEADER_LEN) {
       uint8_t st = PROTO_STATUS_ERR_UNKNOWN_CMD;
       slave_build_cmd_response(resp, CMD_DATA_ACK, &st, 1U);
       return 0;
   }

   uint8_t sub_cmd = req->payload[PROTO_CMD_SUBCMD_OFFSET];

   switch (sub_cmd) {
   case CMD_POLL_REQ:
   {
       if (!Slave_VerifyCmdAuthAndStoreNonce(req)) {
           uint8_t st = PROTO_STATUS_ERR_ID_MISMATCH;
           slave_build_cmd_response(resp, CMD_DATA_ACK, &st, 1U);
           break;
       }

       uint8_t auth_body[AUTH_ARG_LEN + sizeof(g_sensor_data)];
       uint8_t auth_body_len = Slave_BuildPollDataBody(auth_body, sizeof(auth_body));
       if (auth_body_len == 0U) {
           uint8_t st = PROTO_STATUS_ERR_BUSY;
           slave_build_cmd_response(resp, CMD_DATA_ACK, &st, 1U);
           break;
       }

       /* Respond with DATA-type frame:
        *   [DTYPE_ECG_DELTA, g_my_id, g_authorized_master_id, sensor...]
        * DEVICE_ID proves "I am the implant you woke up";
        * MASTER_ID echo proves "I am still bound to this authorised Master". */
       resp->fcf = Proto_FCF_Make(MICS_FCF_TYPE_DATA, false, false);
       resp->payload_len = Proto_BuildDataPayload(MICS_DTYPE_ECG_DELTA,
                                                  g_my_id,
                                                  g_authorized_master_id,
                                                  auth_body,
                                                  auth_body_len,
                                                  resp->payload,
                                                  sizeof(resp->payload));
       break;
   }

