PAKHYUNMOON/CC1101_CC2500/app/slave/s_main.c
   case CMD_STREAM_START:
   {
       if (!Slave_VerifyCmdAuthAndStoreNonce(req)) {
           uint8_t st = PROTO_STATUS_ERR_ID_MISMATCH;
           slave_build_cmd_response(resp, CMD_STREAM_ACK, &st, 1U);
           break;
       }

       if (req->payload_len < (uint8_t)(PROTO_CMD_ARGS_OFFSET + AUTH_ARG_LEN + 2U)) {
           uint8_t st = PROTO_STATUS_ERR_UNKNOWN_CMD;
           slave_build_cmd_response(resp, CMD_STREAM_ACK, &st, 1U);
           break;
       }

       g_stream_interval_ms = req->payload[PROTO_CMD_ARGS_OFFSET + AUTH_ARG_LEN];
       g_stream_remaining_frames = req->payload[PROTO_CMD_ARGS_OFFSET + AUTH_ARG_LEN + 1U];
       if (g_stream_interval_ms == 0U) {
           g_stream_interval_ms = 20U;
       }
       g_stream_enabled = (g_stream_remaining_frames > 0U);
       g_stream_seq = 0U;
       g_stream_frame_counter = 0U;
       
       uint8_t st = PROTO_STATUS_OK;
       slave_build_cmd_response(resp, CMD_STREAM_ACK, &st, 1U);
       break;
   }

   case CMD_STREAM_STOP:
   {
       g_stream_enabled = false;
       g_stream_remaining_frames = 0U;
       uint8_t st = PROTO_STATUS_OK;
       slave_build_cmd_response(resp, CMD_STREAM_ACK, &st, 1U);
       break;
   }

   case CMD_STREAM_NACK:
   {
       /* Optional/low-frequency path: default ACK-only profile keeps
        * behavior simple and power-efficient. We only acknowledge receipt. */
       uint8_t st = PROTO_STATUS_OK;
       slave_build_cmd_response(resp, CMD_STREAM_ACK, &st, 1U);
       break;
   }

   case CMD_DATA_WRITE:
   {
       /* DATA_WRITE args profile (runtime stream config):
        *   args[0] = STREAM_CFG_SUBCMD (0x01)
        *   args[1] = interval_ms
        *   args[2] = frame_count
        */
       uint8_t status = PROTO_STATUS_ERR_UNKNOWN_CMD;
       if (req->payload_len >= (uint8_t)(PROTO_CMD_ARGS_OFFSET + 3U)) {
           const uint8_t *args = &req->payload[PROTO_CMD_ARGS_OFFSET];
           if (args[0] == STREAM_CFG_SUBCMD) {
               uint8_t iv = args[1];
               uint8_t fc = args[2];
               g_stream_interval_ms = (iv == 0U) ? 20U : iv;
               g_stream_remaining_frames = fc;
               status = PROTO_STATUS_OK;
           }
       }
       slave_build_cmd_response(resp, CMD_DATA_ACK, &status, 1U);
       break;
   }

   case CMD_SLEEP_CMD:
       slave_build_cmd_response(resp, CMD_SLEEP_ACK, NULL, 0U);
       break;

   case CMD_SHIP_CMD:
   {
       /* Authenticated ship-mode entry: require the same nonce/MAC as
        * other session commands so an attacker cannot force the implant
        * into storage mode via a spoofed packet. */
       if (!Slave_VerifyCmdAuthAndStoreNonce(req)) {
           uint8_t st = PROTO_STATUS_ERR_ID_MISMATCH;
           slave_build_cmd_response(resp, CMD_SHIP_ACK, &st, 1U);
           break;
       }
       /* Transition is deferred until after the ACK is transmitted
        * (Slave_HandleRxPacket ends the session on CMD_SHIP_CMD). */
       g_power_profile          = SLAVE_RUN_SHIP;
       g_ship_elapsed_sec       = 0U;
       g_ship_last_interval_sec = 0U;
       slave_build_cmd_response(resp, CMD_SHIP_ACK, NULL, 0U);
       break;
   }

   case CMD_KEEPALIVE:
       slave_build_cmd_response(resp, CMD_KEEPALIVE_ACK, NULL, 0U);
       break;

   default:
   {
       uint8_t st = PROTO_STATUS_ERR_UNKNOWN_CMD;
       slave_build_cmd_response(resp, CMD_DATA_ACK, &st, 1U);
       break;
   }
   }

   return 0;
}

static void Slave_SendResponse(const Proto_Packet *resp, uint8_t channel)
{
   uint8_t tx_buf[CC1101_PKT_MAX_LEN];
   uint8_t tx_len = Proto_BuildPacket(resp, tx_buf, sizeof(tx_buf));
   if (tx_len == 0U) {
       return;
   }

   /* Slave responds on the channel Master selected (Master already cleared
    * it via LBT). Use SendPacketLBT with threshold=-120 dBm so the CCA
    * always passes (effectively direct send). */
   (void)CC1101_SendPacketLBT(&g_cc1101, channel,
                              tx_buf, tx_len,
                              -120, 1U, 200U);
}

/* Validate and dispatch one received MICS command packet.
* Returns true if the session should terminate (SLEEP_CMD received). */
static bool Slave_HandleRxPacket(const uint8_t *rx_buf, uint8_t rx_len)
{
   Proto_Packet req_pkt, resp_pkt;

   if (Proto_ParsePacket(rx_buf, rx_len, &req_pkt) < 0) {
       return false;
   }
   if (!Proto_MatchSession(req_pkt.sess, g_session_id)) {
       return false;
   }
   if (g_last_rx_seq_valid && !Proto_IsSeqNewer(req_pkt.seq, g_last_rx_seq)) {
       return false; /* replay/duplicate/out-of-order */
   }
   g_last_rx_seq = req_pkt.seq;
   g_last_rx_seq_valid = true;

   if (Proto_FCF_Type(req_pkt.fcf) != MICS_FCF_TYPE_COMMAND) {
       return false;
   }
   if ((req_pkt.payload_len < PROTO_CMD_HEADER_LEN) ||
       (req_pkt.payload[PROTO_CMD_DTYPE_OFFSET] != MICS_DTYPE_COMMAND)) {
       return false;
   }

   /* Triple-verify the handoff from 2.4 GHz wake-up:
    *   - SESS (already matched above)
    *   - DEVICE_ID in payload offset 2..5
    *   - MASTER_ID in payload offset 6..9
    * DEVICE_ID proves the Master still knows whom it woke up.
    * MASTER_ID proves this is the same authorised Master that
    * initiated the wake-up (and not a concurrent Master guessing
    * the SESS). Silently drop unauthenticated COMMAND frames so
    * the attacker gains no side-channel signal. */
   if (!Proto_VerifyPayloadDeviceID(&req_pkt,
                                    PROTO_CMD_DEVID_OFFSET,
                                    g_my_id)) {
       return false;
   }
   if (!Proto_VerifyPayloadMasterID(&req_pkt,
                                    PROTO_CMD_MASTERID_OFFSET,
                                    g_authorized_master_id)) {
       return false;
   }

   SLAVE_LOG("[SLAVE] cmd_rx seq=%u sess=%u sub=%02X\r\n",
             (unsigned)req_pkt.seq, (unsigned)req_pkt.sess,
             (unsigned)req_pkt.payload[PROTO_CMD_SUBCMD_OFFSET]);
   Slave_ProcessCommand(&req_pkt, &resp_pkt);
   SLAVE_LOG("[SLAVE] cmd_resp_tx sub=%02X\r\n",
             (unsigned)resp_pkt.payload[PROTO_CMD_SUBCMD_OFFSET]);
   Slave_SendResponse(&resp_pkt, g_active_channel);

   if (req_pkt.payload_len < PROTO_CMD_HEADER_LEN) {
       return false;
   }
   uint8_t end_cmd = req_pkt.payload[PROTO_CMD_SUBCMD_OFFSET];
   /* Both SLEEP and SHIP commands terminate the MICS session immediately
    * after the ACK is sent.  For SHIP, g_power_profile was already set to
    * SLAVE_RUN_SHIP inside Slave_ProcessCommand() so the next deep-sleep
    * entry will dispatch to Slave_EnterShipSleep(). */
   return (end_cmd == CMD_SLEEP_CMD) || (end_cmd == CMD_SHIP_CMD);
}

static int Slave_HandleMICSSession(void)
{
   uint8_t rx_buf[CC1101_PKT_MAX_LEN];
   uint8_t rx_len = 0U;
   bool session_active = true;

   g_slave_pwr_trace.mics_session_count++;
   g_slave_pwr_trace.last_session_start_ms = HAL_GetTick();
   SLAVE_LOG("[SLAVE] mics session start ch=%u sess=%u\r\n",
             (unsigned)g_active_channel,
             (unsigned)g_session_id);

   /* Guard: a valid channel must have been assigned in the wake-up beacon */
   if (g_active_channel >= CC1101_MICS_NUM_CHANNELS) {
       return -1;
   }

   /* Initialize CC1101 for MICS communication */
   CC1101_WakeFromSleep(&g_cc1101);
   CC1101_InitMICSLike26MHz(&g_cc1101);

